# BuiltInFailures.SplitSketchBasedElementFailures Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BuiltInFailures..::..SplitSketchBasedElementFailures Members
BuiltInFailures..::..SplitSketchBasedElementFailures Class Properties See Also
---
Provides a container of all Revit built-in FailureDefinitionId instances.
The BuiltInFailures..::..SplitSketchBasedElementFailures type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| NotSplitValidRegions | The split failed. There may be a gap in the boundary loop or the sketch may be incomplete. |

# See Also
BuiltInFailures..::..SplitSketchBasedElementFailures Class
Autodesk.Revit.DB Namespace